# -------------------------------------------------------------------------------------
#1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
#   https://drive.google.com/file/d/1LYEf6pEtSpiaU618FHoaVHJIcEiO9hj8/view?usp=sharing
# -------------------------------------------------------------------------------------

a = 0
while len(str(a)) != 3:
	a = (input("введите 3-х значное число 'а' - "))

a=int(a)	              #нам нужно именно число а не строка 
b = int(a) // 100         #целосичленное деление на 100 3-х значного числа дает нам 1-у цифру
print(b)
c = (a % 100) // 10       #целосичленное деление остатка от деления на 100 3-х значного числа дает нам 2-у цифру
print(c)
d = (a % 10)              #остаток от деления на 10 3-х значного числа дает нам 3-ю цифру
print(d)
e = b + c + d             #вычисляем суммму
p = b * c * d             #вычисляем произведение
print("Сумма цифр 3-х значного числа a: ", e)
print("Произведение цифр 3-х значного числа а: ", p)


