# -------------------------------------------------------------------------------------
#3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
#   https://drive.google.com/file/d/1LYEf6pEtSpiaU618FHoaVHJIcEiO9hj8/view?usp=sharing
# -------------------------------------------------------------------------------------

print("Введите координаты точки A(Xa;Ya):")
Xa = float(input("Xa = "))
Ya = float(input("Ya = "))
 
print("Введите координаты B(Xb;Yb):")
Xb = float(input("Xb = "))
Yb = float(input("Yb = "))
 
# решаем систему уравнений
# Ya = kXa + b
# Yb = kXb + b
#
# b = kXa - Ya
# тогда
# Yb = kXb + kXa - Ya
# k = (Ya - Yb) / (Xa - Xb)
# и
# b = Yb - k*Xb
#
print("По введенным координатам двух точек выводим уравнение прямой вида y=kx+b, проходящей через эти точки.:")
k = (Ya - Yb) / (Xa - Xb)
b = Yb - k*Xb
print(" y = ", k,"x + ", b)

