# -------------------------------------------------------------------------------------
#2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. 
#   Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака. 
#   Объяснить полученный результат.
#   https://drive.google.com/file/d/1LYEf6pEtSpiaU618FHoaVHJIcEiO9hj8/view?usp=sharing
# -------------------------------------------------------------------------------------

a = 5
b = 6
print("a = ", bin(a) )
print("b = ", bin(b) )
print("---------------------------\n\n")
print(" Побитовое или             a | b = ", bin(a | b), "     равно числу - ", a | b )            #Побитовое или
print(" Побитовое исключающее или a ^ b = ", bin(a ^ b), "     равно числу - ", a ^ b  )           #Побитовое исключающее или
print(" Побитовое и               a & b = ", bin(a & b), "     равно числу - ", a & b  )           #Побитовое и
print(" Побитовый сдвиг влево     a << 2 = ", bin(a << 2), "   равно числу - ", a << 2  )          #Побитовый сдвиг влево
print(" Побитовый сдвиг вправо    a >> 2 = ", bin(a >> 2), "   равно числу - ", a >> 2  )          #Побитовый сдвиг вправо
