# -------------------------------------------------------------------------------------
# 4. Написать программу, которая генерирует в указанных пользователем границах:
#    случайное целое число;
#    случайное вещественное число;
#    случайный символ.
#   https://drive.google.com/file/d/1LYEf6pEtSpiaU618FHoaVHJIcEiO9hj8/view?usp=sharing
# -------------------------------------------------------------------------------------

print("Введите границы для генерации челого числа: ")
X_int = int(input("X_int= "))
Y_int = int(input("Y_int = "))
 
print("Введите границы для генерации вещественного числа: ")
X_float = float(input("X_float = "))
Y_float = float(input("Y_float = "))

print("Введите последовательность для генерации символа: ")
X_str = str(input("X_str = "))


import random
print(" случайное число из диапазона от ", X_int, " до ", Y_int, " = ", random.randint(X_int,Y_int))
print(" случайное вещественное из диапазона от ", X_float, " до ", Y_float, " = ", random.uniform(X_float,Y_float))
print(" случайный символ из последовательности ", X_str, " = ", random.choice(X_str))