# -------------------------------------------------------------------------------------
#  6.  В программе генерируется случайное целое число от 0 до 100. 
#      Пользователь должен его отгадать не более чем за 10 попыток. 
#      После каждой неудачной попытки должно сообщаться больше или меньше введенное пользователем число,
#      чем то, что загадано. 
#      Если за 10 попыток число не отгадано, то вывести загаданное число.
#
#   https://drive.google.com/file/d/1WAhetx8AEQ7kfo9tvFRBn2_IS8OuNj4y/view?usp=sharing
# -------------------------------------------------------------------------------------	 

'''
функция is_number_0_100() проверяет значение на число из диапозона 
----------------------------------------------------------------------
'''
def is_number_0_100(a, m, n):              #a - проверяемое значение, m - начало диапазона, n - конец диапозона 
	try:
		a = int(a)                         #не число нельзя привести к типу Integer
	except:
		return False 
		
	if int(a) < 0  or int(a) > n:         #д.б. от 0 до 100
		return False
	
	return True	
'''
----------------------------------------------------------------------
'''

import random
random_number = random.randint(0,100)

print(random_number)
i = 1
while i <= 10:
	guess = input(" Введите сисло от 0 до 100     -          ")
	if is_number_0_100(guess, 0, 100):
		guess = int(guess)
		if guess == random_number:
			print("ВЫ УГАДАЛИ !!!!!! ")
			break                             #выходим из while
		elif guess > random_number:
			print("Загаданное число меньше указанного вами ")
		elif guess < random_number:
			print("Загаданное число больше указанного вами ")
	else:
		print("введенное вами значение не является целым числом от 0 до 100 ")
	i += 1
	
if i == 11:
	print("НЕ УГАДАЛИ, число  =   ", random_number)

