# -------------------------------------------------------------------------------------
#  3. Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран. 
#     Например, если введено число 3486, то надо вывести число 6843.
#
#   https://drive.google.com/file/d/1WAhetx8AEQ7kfo9tvFRBn2_IS8OuNj4y/view?usp=sharing
# -------------------------------------------------------------------------------------	 

a = int(input("Введите число         "))
a_string = str(a)              # конвертируем в str чтобы узнать длину введенного значения и пройтись по цифрам 

print("Оригинальное введенное число:  ", a)

a_reversed = ""                            # строка для сборки перевернутого числа


for i in range(len(a_string)):
	a_reversed = a_reversed + str (a % 10) # остаток деления на 10 является первой с конца цифрой
	a = a // 10                            # целочисленным делением на 10 отбрасываем последнюю цифру от числа
	#print(a)



print("\"Перевернутое\" число:  ", a_reversed)	 