# -------------------------------------------------------------------------------------
#  2. Посчитать четные и нечетные цифры введенного натурального числа. 
#     Например, если введено число 34560, 
#     то у него 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).
#
#   https://drive.google.com/file/d/1WAhetx8AEQ7kfo9tvFRBn2_IS8OuNj4y/view?usp=sharing
#
# -------------------------------------------------------------------------------------
# Натуральное число д.б. положительным и целым

'''
функция is_natutal_number() проверяет число на натураьность
----------------------------------------------------------------------
'''
def is_natutal_number(a):
	try:
		a = int(a)                #не натуральное число нельзя привести к типу Integer
	except:
		return False 
		
	if int(a) < 1:                #отрицательное число не м.б. натуральным
		return False
	return True	
'''
----------------------------------------------------------------------
'''
	
	
	
a = input("введите натуральное число:        ")
	
if is_natutal_number(a):
	print("введенное число является натуральным")   # можно считать четные / нечетные цифры
	even_amount     = 0          # счетчик для четных 
	not_even_amount = 0          # счетчик для нечетных
	
	a_string = str(a) 	             # конвертируем в str чтобы узнать длину введенного значения и пройтись по цифрам
	for i in range(len(a_string)):
		if int(a_string[i]) % 2 == 0:
			even_amount      += 1
		else:
			not_even_amount  += 1
	print("Количество нечетных цифр в числе ", a ," равно ", not_even_amount)
	print("Количество четных цифр в числе ", a ,"   равно ", even_amount)
	
else:
	print("число не является натуральным")	
	

