# -------------------------------------------------------------------------------------
#   1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа. 
#   Числа и знак операции вводятся пользователем. 
#   После выполнения вычисления программа не должна завершаться, а должна запрашивать новые данные для вычислений. 
#   Завершение программы должно выполняться при 
#   вводе символа '0' в качестве знака операции. 
#	Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), 
#   то программа должна сообщать ему об ошибке и снова запрашивать знак операции. 
#   Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.
# -------------------------------------------------------------------------------------


while True:
	operator = input("Введите арифметический оператор или \"0\" для выхода из программы: ")
   	
	if operator in ('+','-','*','/','0'):
		if operator == '0':
			print("вы вышли из программы")
			break

		a = int(input("введите первое число a = "))
		b = int(input("введите второе число b = "))
	
		if operator == '+':
			print("a+b = ", a+b)
		elif operator == '-':
			print("a-b = ", a-b)
		elif operator == '*':
			print("a*b = ", a*b)
		elif operator == '/':
			if b == 0:
				print("Деление на ноль!")
			else:
				print("a/b = ", a/b)
	else:
		print("Некорректный знак операции! \n\n")

