# -------------------------------------------------------------------------------------
#  5.  Вывести на экран коды и символы таблицы ASCII, 
#      начиная с символа под номером 32 и заканчивая 127-м включительно. 
#      Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.
#
#   https://drive.google.com/file/d/1WAhetx8AEQ7kfo9tvFRBn2_IS8OuNj4y/view?usp=sharing
# -------------------------------------------------------------------------------------	 
a = 32
b = 127

line = ""

while a <= b:
	i  = 1
	for i in range(10):
		line = line + "   \"" + str(a) + "-" + str(chr(a)) + "\"       "
		a += 1
	print(line)
	line = ""
	