# -------------------------------------------------------------------------------------
#  4.  Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
#      Количество элементов (n) вводится с клавиатуры.
#
#   https://drive.google.com/file/d/1WAhetx8AEQ7kfo9tvFRBn2_IS8OuNj4y/view?usp=sharing
# -------------------------------------------------------------------------------------	 

sum_row_item = 0          #сумма элементов ряда  

n  = int(input("Введите кол-во элементов ряда     "))

i = 1                     # 
while i <= n:
	if i == 1:
		row_item = 1              #первый элемент ряда
	else:
		row_item = row_item / (-2)
	
	print(i-1, "-----", row_item)
	sum_row_item = sum_row_item + row_item
	i += 1
	
print("Сумма элементов ряда ",sum_row_item)	
